request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getWorkorderRequest>
         <gs:wonum>DD2222</gs:wonum>
      </gs:getWorkorderRequest>
   </soapenv:Body>
</soapenv:Envelope>
